Revit 2024 API
PathOfTravel.SetRevealObstaclesMode Method
 Sets Reveal Obstacles mode for the given view.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public static PathOfTravelCalculationStatus SetRevealObstaclesMode(
	View DBView,
	bool newState
)
Visual Basic
Public Shared Function SetRevealObstaclesMode ( _
	DBView As View, _
	newState As Boolean _
) As PathOfTravelCalculationStatus
Visual C++
public:
static PathOfTravelCalculationStatus SetRevealObstaclesMode(
	View^ DBView,
	bool newState
)
Parameters
DBView
Type: Autodesk.Revit.DB.View
 The view to set Reveal Obstacles mode for.
newState
Type: System.Boolean
 New state of Reveal Obstacles mode to be set for the view.
Return Value
 Result status of the operation.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The element "DBView" is in a family document or a document in in-place edit mode. -or- View is not a floor plan view.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The document containing DBView is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The Path of Travel calculation service is not available
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document containing DBView is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document containing DBView is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document containing DBView has no open transaction.
See Also
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace